## Plan Result (sbox-apim)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 0 to change, 3 to destroy.</code></pre>

* Replace
  * module.api-mgmt.azurerm_api_management.apim
  * module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain
  * module.api-mgmt.azurerm_role_assignment.apim




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.api-mgmt.data.azurerm_api_management.apim will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_api_management" "apim" {
      + additional_location       = (known after apply)
      + developer_portal_url      = (known after apply)
      + gateway_regional_url      = (known after apply)
      + gateway_url               = (known after apply)
      + hostname_configuration    = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + location                  = (known after apply)
      + management_api_url        = (known after apply)
      + name                      = "sds-api-mgmt-sbox"
      + notification_sender_email = (known after apply)
      + portal_url                = (known after apply)
      + private_ip_addresses      = (known after apply)
      + public_ip_address_id      = (known after apply)
      + public_ip_addresses       = (known after apply)
      + publisher_email           = (known after apply)
      + publisher_name            = (known after apply)
      + resource_group_name       = "ss-sbox-network-rg"
      + scm_url                   = (known after apply)
      + sku_name                  = (known after apply)
      + tags                      = (known after apply)
      + tenant_access             = (known after apply)
    }

  # module.api-mgmt.azurerm_api_management.apim must be replaced
-/+ resource "azurerm_api_management" "apim" {
      ~ developer_portal_url          = "https://sds-api-mgmt-sbox.developer.azure-api.net" -> (known after apply)
      ~ gateway_regional_url          = "https://sds-api-mgmt-sbox-uksouth-01.regional.azure-api.net" -> (known after apply)
      ~ gateway_url                   = "https://sds-api-mgmt-sbox.azure-api.net" -> (known after apply)
      ~ id                            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-sbox" -> (known after apply)
      ~ management_api_url            = "https://sds-api-mgmt-sbox.management.azure-api.net" -> (known after apply)
        name                          = "sds-api-mgmt-sbox"
      ~ policy                        = [
          - {
              - xml_content = <<-EOT
                    <!--
                        IMPORTANT:
                        - Policy elements can appear only within the <inbound>, <outbound>, <backend> section elements.
                        - Only the <forward-request> policy element can appear within the <backend> section element.
                        - To apply a policy to the incoming request (before it is forwarded to the backend service), place a corresponding policy element within the <inbound> section element.
                        - To apply a policy to the outgoing response (before it is sent back to the caller), place a corresponding policy element within the <outbound> section element.
                        - To add a policy position the cursor at the desired insertion point and click on the round button associated with the policy.
                        - To remove a policy, delete the corresponding policy statement from the policy document.
                        - Policies are applied in the order of their appearance, from the top down.
                    -->
                    <policies>
                    	<inbound />
                    	<backend>
                    		<forward-request />
                    	</backend>
                    	<outbound />
                    </policies>
                EOT
              - xml_link    = ""
            },
        ] -> (known after apply)
      ~ portal_url                    = "https://sds-api-mgmt-sbox.portal.azure-api.net" -> (known after apply)
      ~ private_ip_addresses          = [] -> (known after apply)
      ~ public_ip_addresses           = [
          - "20.58.1.5",
        ] -> (known after apply)
      ~ scm_url                       = "https://sds-api-mgmt-sbox.scm.azure-api.net" -> (known after apply)
        tags                          = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      ~ virtual_network_type          = "External" -> "Internal" # forces replacement
      - zones                         = [] -> null
        # (9 unchanged attributes hidden)

      - delegation {
          - subscriptions_enabled     = false -> null
          - user_registration_enabled = false -> null
        }

      - hostname_configuration {
          - proxy {
              - certificate_source           = "BuiltIn" -> null
              - default_ssl_binding          = false -> null
              - host_name                    = "sds-api-mgmt-sbox.azure-api.net" -> null
              - negotiate_client_certificate = false -> null
            }
          - proxy {
              - certificate_source           = "KeyVault" -> null
              - default_ssl_binding          = true -> null
              - expiry                       = "2023-07-08T23:02:23Z" -> null
              - host_name                    = "sds-api-mgmt.sandbox.platform.hmcts.net" -> null
              - key_vault_id                 = "https://acmedtssdssbox.vault.azure.net/secrets/wildcard-sandbox-platform-hmcts-net" -> null
              - negotiate_client_certificate = true -> null
              - subject                      = "CN=*.sandbox.platform.hmcts.net" -> null
              - thumbprint                   = "041A2734339524713EF3393230FAAB9A60D76DC8" -> null
            }
          - proxy {
              - certificate_source           = "KeyVault" -> null
              - default_ssl_binding          = true -> null
              - expiry                       = "2023-07-08T23:02:23Z" -> null
              - host_name                    = "sds-api-mgmt-appgw.sandbox.platform.hmcts.net" -> null
              - key_vault_id                 = "https://acmedtssdssbox.vault.azure.net/secrets/wildcard-sandbox-platform-hmcts-net" -> null
              - negotiate_client_certificate = true -> null
              - subject                      = "CN=*.sandbox.platform.hmcts.net" -> null
              - thumbprint                   = "041A2734339524713EF3393230FAAB9A60D76DC8" -> null
            }
        }

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "9e962e63-39f9-490e-8eb3-b01f29fbf2b2" -> (known after apply)
          ~ tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      - protocols {
          - enable_http2 = false -> null
        }

      - security {
          - enable_backend_ssl30                                = false -> null
          - enable_backend_tls10                                = false -> null
          - enable_backend_tls11                                = false -> null
          - enable_frontend_ssl30                               = false -> null
          - enable_frontend_tls10                               = false -> null
          - enable_frontend_tls11                               = false -> null
          - tls_ecdhe_ecdsa_with_aes128_cbc_sha_ciphers_enabled = false -> null
          - tls_ecdhe_ecdsa_with_aes256_cbc_sha_ciphers_enabled = false -> null
          - tls_ecdhe_rsa_with_aes128_cbc_sha_ciphers_enabled   = false -> null
          - tls_ecdhe_rsa_with_aes256_cbc_sha_ciphers_enabled   = false -> null
          - tls_rsa_with_aes128_cbc_sha256_ciphers_enabled      = false -> null
          - tls_rsa_with_aes128_cbc_sha_ciphers_enabled         = false -> null
          - tls_rsa_with_aes128_gcm_sha256_ciphers_enabled      = false -> null
          - tls_rsa_with_aes256_cbc_sha256_ciphers_enabled      = false -> null
          - tls_rsa_with_aes256_cbc_sha_ciphers_enabled         = false -> null
          - tls_rsa_with_aes256_gcm_sha384_ciphers_enabled      = false -> null
          - triple_des_ciphers_enabled                          = false -> null
        }

      - sign_in {
          - enabled = false -> null
        }

      - sign_up {
          - enabled = false -> null

          - terms_of_service {
              - consent_required = false -> null
              - enabled          = false -> null
            }
        }

      - tenant_access {
          - enabled       = false -> null
          - primary_key   = (sensitive value) -> null
          - secondary_key = (sensitive value) -> null
          - tenant_id     = "/tenant/access" -> null
        }

        # (1 unchanged block hidden)
    }

  # module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain must be replaced
-/+ resource "azurerm_api_management_custom_domain" "api-management-custom-domain" {
      ~ api_management_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-sbox" # forces replacement -> (known after apply) # forces replacement
      ~ id                = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-sbox/customDomains/default" -> (known after apply)

      ~ gateway {
          + certificate_source           = (known after apply)
          + certificate_status           = (known after apply)
          + expiry                       = (known after apply)
          + subject                      = (known after apply)
          + thumbprint                   = (known after apply)
            # (4 unchanged attributes hidden)
        }
      ~ gateway {
          + certificate_source           = (known after apply)
          + certificate_status           = (known after apply)
          + expiry                       = (known after apply)
          + subject                      = (known after apply)
          + thumbprint                   = (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.api-mgmt.azurerm_role_assignment.apim must be replaced
-/+ resource "azurerm_role_assignment" "apim" {
      ~ id                               = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/sds-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedtssdssbox/providers/Microsoft.Authorization/roleAssignments/f727d7d0-4312-cda3-d9f8-4fa14cbb4ff9" -> (known after apply)
      ~ name                             = "f727d7d0-4312-cda3-d9f8-4fa14cbb4ff9" -> (known after apply)
      ~ principal_id                     = "9e962e63-39f9-490e-8eb3-b01f29fbf2b2" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":429,"Program":"tfcmt","SHA1":"","Target":"sbox-apim","Vars":{}} -->